[
  { "lines": [
    {"text": "practice makes", "type": "title" },
    {"text": "a piece for you to perform, alone, in the dark"},
    {"text": "Photosensitivity warning: This piece abruptly changes from dark to light, but these changes are brief and infrequent."}
  ]},
  { "lines": [
    {"text": "We're going to go on a walk together at night, you and I,"},
    {"text": "but we'll just be standing still."},
    {"text": "Make sure you're somewhere dark so you can pretend."},
    {"text": "I'll wait."}
  ]},
  {"lines": [
    {"text": "Are you somewhere dark?"},
    {"type": "choices", "choices": [
      {"text": "Yes", "result": {"text": "Good."}},
      {
        "text": "No", 
        "result": {
          "text": "It will be harder to enjoy this piece if it's bright where you are. Try closing your eyes and pressing the Test button below a few times to make sure you can tell the difference."
        },
        "action": "showTestButton"
      }
    ]}
  ]},
  {"lines": [
    {"text": "Are you alone?"},
    {"type": "choices", "choices": [
      {"text": "Yes", "result": {"text": "Good."}},
      {"text": "No", "result": {
        "text": "That's okay. We're always a little bit alone. Try to pretend it's just the two of us."
      }}
    ]}
  ]},
  {"lines": [
    {"text": "Are you standing or sitting still?", "postWait": 200},
    {"type": "choices", "choices": [
      {"text": "Yes", "result": {"text": "Good."}},
      {"text": "No", "result": {
        "text": "Stop somewhere dark before you keep going. Our walk will be more interesting if you aren't. Sitting in a car is fine."
      }}
    ]}
  ]},
  {"lines": [
    {"text": "The rules", "type": "title"},
    {"text": "There are only two rules for our walk. We'll practice both."},
    {"text": "Rule #1: Stay completely still. I'll ask you to move throughout the piece, but don't move your physical body; you should only visualize and imagine the movements.", "postWait": 1000}
  ]},
  {"lines": [
    {"text": "The rules", "type": "title", "wordWait": 0},
    {"text": "Let's try something simple. Remember: don't move your real body, but instead imagine these actions in as much detail as possible."},
    {"text": "Swing your arms back and forth at your sides, with your arms alternating direction.", "postWait": 3000},
    {"text": "Keep swinging, but now make both arms go in the same direction.", "postWait": 3000},
    {"text": "Try and feel the momentum, the way your arms swish against your clothes, the way your whole body twists ever-so-slightly.", "postWait": 3000}
  ]},
  {"lines": [
    {"text": "The rules", "type": "title", "wordWait": 0},
    {"text": "Great. Second rule."},
    {"text": "Rule #2: Whenever the screen turns white, close your eyes. "},
    {"text": "You're only allowed to open your eyes when the screen is dark."}
  ]},
  {"lines": [
    {"type": "title", "text": "The rules", "wordWait": 0},
    {"text": "We'll practice this one as well. Close your eyes as soon as you see white, and open them when the light feels like it's gone dark again."}
  ]},
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SHUT", "style": "5em", "wordWait": 0}
    ]
  },
  {
    "type": "black",
    "lines": [
      {"text": "Great. You should be opening your eyes."},
      {"text": "Could you tell the difference?"},
      {"type": "choices", "choices": [
        {"text": "Yes", "result": {"text": "Good."}},
        {
          "text": "No", 
          "result": {
            "text": "Try going somewhere darker and try again. You can press this button to see if you're somewhere dark enough."
          },
          "action": "showTestButton"
        }
      ]}
    ]
  },
  {
    "type": "black",
    "lines": [
      {"text": "Let's begin the walk.", "type": "title"}
    ]
  },
  {
    "lines": [
      {"text": "We're sitting at an outdoor cafe, you and I. It's late; the sun set about an hour ago."},
      {"text": "We're on either side of a metal lattice patio table. Circular, lightly rusted, and the feet screech and scrape against the concrete whenever we bump it."},
      {"text": "Can you bump into the table by accident and hear that sound?"}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SCREECH", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"text": "We're both drinking something, but the drink and its container are up to you: hot, cold, beer, coffee, teacup, stein, etc. Follow your first instinct.", "wordWait": 180, "postWait": 800},
      {"text": "Reach for your drink, and feel your fingers grasp against the glass. When you lift it, how tightly do you need to hold it?", "postWait": 800},
      {"text": "Can you taste it?", "wordWait": 180}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "DRINK", "style": "5em"}
    ],
    "postWait": 2500
  },
  {
    "lines": [
      {"text": "Now put it back down, and hear the lattice tabletop rattle just a little as it lands."},
      {"text": "With one hand resting on the table, tap the glass with your fingernail. What sound does it make?", "postWait": 2000},
      {"text": "Imagine humming that pitch, feeling your vocal chords vibrating inside your neck, and the sound buzzing against your closed lips.", "postWait": 2000}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "TINK", "style": "5em"}
    ],
    "postWait": 4000
  },
  {
    "lines": [
      {"text": "We already paid for our drinks awhile ago, but like I said, it's late, and we should probably think about leaving."},
      {"text": "Imagine every part of standing up."}
    ],
    "postWait": 2000
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STAND", "style": "5em"}
    ],
    "postWait": 2000
  },
  {
    "type": "black",
    "lines": [
      {"text": "Hmm. Not quite."},
      {"text": "I should probably have given you better instructions. Let's think smaller. Standing up is a complicated action, after all."},
      {"text": "Let's start with your hands."}
    ],
    "postWait": 2000
  },
  {
    "lines": [
      {"type": "title", "text": "Your hands"},
      {"text": "Put both hands flat on the table, and pull them towards you loosely.", "postWait": 1000},
      {"text": "Feel your fingertips dip and bounce in and out of the holes in the lattice as they move.", "postWait": 1000},
      {"text": "Hear the sound they make as they drift, a mix of ringing, tapping, and scratching."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "PULL", "style": "5em"}
    ],
    "postWait": 3000
  },
  {
    "type": "black",
    "lines": [
      {"type": "title", "text": "Your hands", "wordWait": 0},
      {"text": "Keep pulling your hands towards you until they're at edge of the table, so that only your fingers and thumbs are still touching the lattice.", "postWait": 1500},
      {"text": "Hold here a moment, but don't relax. Can you feel how your shoulders tense to keep your forearms afloat?", "postWait": 2500},
      {"text": "With your forearms hovering, no longer supported by the table, let gravity naturally lower your wrists."}
    ],
    "postWait": 2000
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "FALL", "style": "5em"}
    ],
    "postWait": 2500
  },
  {
    "type": "black",
    "lines": [
      {"type": "title", "text": "Your hands", "wordWait": 0},
      {"text": "Repeat this motion."},
      {"text": "Hands on the table, drag them towards you, then let your wrists droop as you hang on to the table's edge with your fingers.", "postWait": 1800},
      {"text": "Repeat it again.", "postWait": 1000},
      {"text": "Do you repeat naturally, by moving your arms back to the starting position each time? Or do you repeat the motion as if you were moving the playhead on a movie, jumping erratically from one timestamp to another?"}
    ],
    "postWait": 2500
  },
  {
    "type": "black",
    "lines": [
      {"type": "title", "text": "Pushing out"},
      {"text": "Now, with our hands holding the table for support, we should be able to push our chair out, which will give us room to stand."},
      {"text": "Press away from your torso, palms pushing against the edge of the table.", "postWait": 1600},
      {"text": "Push hard, so you can push your chair out and away from the"}
    ],
    "postWait": 200
  },
  
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "PUSH", "style": "5em"}
    ],
    "postWait": 1500
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing out", "wordWait": 0},
      {"text": "table, but not so hard!"},
      {"text": "The table isn't screwed in to the ground, and both the table and the chairs are sitting on concrete, so the table probably moved instead of the chair.", "postWait": 1200},
      {"text": "You may have just pushed it at me."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing out", "wordWait": 0},
      {"text": "We'll try that again, but have fun for a moment repeating the animation of you shoving the table by accident instead of pushing your chair out.", "postWait": 2000},
      {"text": "How far can it travel? What's the sound like when it lands? (Or does it land at all?)"},
      {"text": "Where do our glasses end up?"}
    ],
    "postWait": 2000
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "REALLY PUSH THIS TIME", "style": "5em"}
    ],
    "postWait": 4000
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing down"},
      {"text": "Back to the business of standing. To make this work, we need to lift ourselves above the chair for a moment."},
      {"text": "Instead of just pushing outwards with our hands, we need to push down, both with our hands and feet."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing down", "wordWait": 0},
      {"text": "Our hands have to push down into the table to keep steady,"},
      {"text": "and our feet have to press down into the concrete beneath us."},
      {"text": "Slide your feet into position. Hear the sound of friction between your shoes and the ground."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing down", "wordWait": 0},
      {"text": "This should be enough to get us slightly out of the chair. Pause right here, and hold this position.", "postWait": 1000},
      {"text": "We're not standing, sitting, or even squatting; we're just barely hovering over the seat."},
      {"text": "Feel the backs of your calves and thighs tense from this strange position."},
      {"text": "Now, get ready to"}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "PUSH", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing down", "wordWait": 0},
      {"text": "push. Oh! Did you push down too hard with your hands, flipping the table towards you? Guess it wasn't very stable!"},
      {"text": "If you didn't, try it anyway. The tabletop lands on its edge right on your feet. Ow!", "postWait": 1000},
      {"text": "The crash it makes rings through the whole lattice. The glasses fall or fly in your direction. Do they break?"}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "CRASH", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"text": "This sort of thing always seems to happen in my dreams. I keep repeating the same thing over and over again, to see if I can make it perfect."},
      {"text": "Most of the time it just gets worse, either catastrophically or comically. Or both."},
      {"text": "Does this happen to you, too? Or is it just me?"}
    ],
    "postWait": 1500
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "IT'S JUST YOU", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "Pushing down", "wordWait": 0},
      {"text": "Anyway, back to where we were. Let's repeat that whole motion."},
      {"text": "You pushed down with your hands and feet just enough to push your pelvis slightly off the chair, then held that position, calves and thighs tensed. You should be barely squatting."}
    ],
    "postWait": 2000
  },
  {
    "lines": [
      {"type": "title", "text": "Straighten"},
      {"text": "From here, figure out the perfect balance of pushing between your hands and feet to get yourself standing.", "postWait": 1000},
      {"text": "Feel the relief in your calves and thighs as your leg straightens out. Your knee joins the column of strength in your leg.", "postWait": 1000},
      {"text": "Your hands naturally fall towards your sides as you rise above the lattice tabletop.", "postWait": 1000},
      {"text": "Your straightened leg pushes into the seat of the chair, nudging it back a little. Hear the chair scratch against the"}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STAND", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"text": "concrete."},
      {"type": "title", "text": "Standing"},
      {"text": "Congratulations! You've now stood up from the table. Celebrate by leading away from the chair with one foot, and following with the other."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "LEAD", "style": "5em"}
    ],
    "postWait": 2000
  },
  {
    "lines": [
      {"text": "Now that we've got the steps, let's put it all together from the beginning."},
      {"text": "1. Hands on table. Pull them towards you. Stop at the table's edge. Wrists drop.", "wordWait": 200, "postWait": 1000},
      {"text": "2. Slide feet back. Hands press into the table, feet press onto the ground. Lift to a half-squat.", "wordWait": 200, "postWait": 1000},
      {"text": "3. Straighten your legs, and step away.", "wordWait": 200, "postWait": 1000},
      {"text": "Keep repeating the motions and imagining the sounds, as well. Find a tempo."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "DANCE", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"text": "Think about this standing motion as if you were a sequencer. Each motion, each sound, happens on a step.", "postWait": 1000},
      {"text": "You could delay a motion by a beat. Or, turn a dial and make the tempo of the whole sequence slow down.", "wordWait": 190, "postWait": 1000},
      {"text": "Or, add a new motion on an unused beat, one I haven't even thought to include here."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The foley artist"},
      {"text": "Imagine a foley artist a few meters behind you, someone whose job it is to perform all the sound design in films.", "postWait": 1000},
      {"text": "Today, they're adding sound effects on top of your sequence.", "postWait": 900},
      {"text": "They're starting with your shoes. They sprinkle some dirt on the ground for grit, put their hands in a pair of shoes like yours, and step or scrape with you."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The foley artist", "wordWait": 0},
      {"text": "Pull, press, straighten, step away. Keep repeating the sequence.", "postWait": 1200},
      {"text": "As you continue the motions, staying aware of your movement, hear the sound of your shoes coming from the foley artist", "postWait": 100, "wordWait": 180}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SCUFF", "style": "5em"}
    ],
    "postWait": 1000
  },
  {
    "lines": [
      {"text": "behind you."},
      {"type": "title", "text": "The film crew"},
      {"text": "You can also see several members of a film crew near you (cameraman, boom operators, the director).", "postWait": 1200},
      {"text": "It may be hard to tell from where you're sitting (or standing, depending on where you are in your loop), but the camera is pointed at you.", "postWait": 1500}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The film crew", "wordWait": 0},
      {"text": "What angle does the camera see you from? Move the foley artist around if they're in the shot.", "postWait": 2000},
      {"text": "Repeat your motion again, this time looking from", "postWait": 200}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "ACTION", "style": "5em"}
    ],
    "postWait": 800
  },
  {
    "lines": [
      {"text": "the camera's perspective."},
      {"type": "title", "text": "The movie"},
      {"text": "I suppose you must be in a movie. Does that change anything for you?", "postWait": 1500},
      {"text": "Do you loom over the table a bit as you begin to rise? Do you flip the table towards me, because you need to make a break for it? Why is the film so focused on how you leave this conversation?", "postWait": 1800},
      {"text": "The camera pans as you keep standing. Why is it doing that? Where", "postWait": 200}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STAND", "style": "5em"}
    ],
    "postWait": 500
  },
  {
    "lines": [
      {"text": "is it leading our eyes?"},
      {"text": "This sort of thing always seems to happen in my dreams. I keep repeating the same thing over and over again, to see if I can make it perfect."},
      {"text": "Or different, at least. I might be doing the same thing, but the reason or the location might be"}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "DIFFERENT", "style": "5em"}
    ],
    "postWait": 500
  },
  {
    "lines": [
      {"text": "different than it started.", "wordWait": 180},
      {"text": "Have you ever tried to rehearse an argument? Of course you have.", "wordWait": 220},
      {"text": "You want to control how time passed. You want to be right. But I always find myself", "wordWait": 250}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "BLINK", "style": "5em"}
    ],
    "postWait": 500
  },
  {
    "lines": [
      {"text": "different than I started.", "postWait": 700},
      {"text": "... anyways."},
      {"text": "Production wants to change the setting entirely, so we're doing this in a motion capture studio so they can replace everything with their 3D models of choice."}
    ],
    "postWait": 1800
  },
  {
    "lines": [
      {"type": "title", "text": "The soundstage"},
      {"text": "You're in a soundstage inside an enormous warehouse. Every part of your set has been painted green so they can chromakey it out: the walls, the floors, even the table and chairs.", "postWait": 1500},
      {"text": "Violently green, even. The table and chairs are clearly plywood, sanded down just enough to be safe."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The soundstage", "wordWait": 0},
      {"text": "You're wearing a stretchy spandex motion capture suit covered in little reflective spheres. Touch one of the spheres: small, hard plastic, attached with velcro.", "postWait": 1000},
      {"text": "Pull it off."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "RIP", "style": "5em"}
    ],
    "postWait": 1500
  },
  {
    "lines": [
      {"type": "title", "text": "The soundstage", "wordWait": 0},
      {"text": "You probably shouldn't have done that! Someone whose name you don't remember probably spent a long time placing them."},
      {"text": "But don't worry, this is your mind. No one will yell at you unless you want them to."},
      {"text": "Unless that's something you're trying to practice.", "wordWait": 250},
      {"text": "Or at least, they shouldn't.", "postWait": 700},
      {"text": "Let's get back to standing."}
    ]
  },
  {
    "lines": [
      {"text": "Now that things have changed, let's slow down the speed of sequence. How do the sounds change with plywood furniture and a quiet soundstage?", "wordWait": 250},
      {"text": "There are no lattice gaps for your fingers, no concrete or metal to scrape against. Everything is hollow.", "wordWait": 280},
      {"text": "Look behind you at the foley artist. What are they doing differently for your shoes? Are they recreating the sound of your original table, or", "wordWait": 250}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "RIP", "style": "5em"}
    ],
    "postWait": 1000
  },
  {
    "lines": [
      {"text": "something completely different?"},
      {"text": "Do you wonder what the foley artist thinks of you? Standing back so far, making your sounds for you?", "wordWait": 280},
      {"text": "They probably don't", "wordWait": 280}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "THINK", "style": "5em"}
    ],
    "postWait": 500
  },
  {
    "lines": [
      {"text": "think very much of you at all.", "wordWait": 350},
      {"type": "title", "text": "The director's view"},
      {"text": "Try to see through the director's eyes now, while you continue repeating.", "postWait": 1400},
      {"text": "They're watching the data version of you, on a tiny little screen, based on all your reflective tracker spheres.", "postWait": 1500}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The director's view", "wordWait": 0},
      {"text": "You've been reduced to dozens or perhaps hundreds of disconnected dots, no surface blocking your back from your front.", "postWait": 1500},
      {"text": "The table is gone, the chairs are gone; it's just you, standing on repeat, everything missing but this data visualization.", "wordWait": 250},
      {"text": "Do you look like a stick figure, on that tiny screen? Or can you see how the polygons", "wordWait": 220}
    ],
    "postWait": 300
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "CONNECT", "style": "5em"}
    ],
    "postWait": 1000
  },
  {
    "lines": [
      {"text": "connect to almost become skin?"},
      {"type": "title", "text": "Your body, no body"},
      {"text": "Can you feel all those dots beneath your flesh, like little connection points for stick-straight veins?"},
      {"text": "As they look at your generated, data-self, are they", "wordWait": 250}
    ],
    "postWait": 300
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "DISAPPOINTED", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"text": "disappointed by what they see? Can you stand up better, somehow?", "wordWait": 300, "postWait": 800},
      {"type": "title", "text": "Your movement"},
      {"text": "More dynamically? More like an actual human would stand? Can you make the director proud of your bones, your veins?", "wordWait": 100},
      {"text": "Or is it impossible? In the dreams, \"better\" is often", "wordWait": 250}
    ],
    "postWait": 300
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "IMPOSSIBLE", "style": "5em"}
    ],
    "postWait": 800
  },
  {
    "lines": [
      {"text": "impossible."},
      {"type": "title", "text": "The 3D artist"},
      {"text": "Moving on. There's a 3D artist somewhere, hundreds of miles away from you, weeks in the future, making sense of all the data in those bones of yours.", "postWait": 1500},
      {"text": "You've got topology now, optimized polygons representing you with the minimum number of shapes.", "postWait": 800},
      {"text": "Feel them: large, long rectangles running along your arms and legs; small, tight squares", "wordWait": 250, "postWait": 200}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SQUARES", "style": "5em"}
    ],
    "postWait": 800
  },
  {
    "lines": [
      {"text": "outlining the plateaus on your face. You're weightless, now. Beyond weightless."},
      {"type": "title", "text": "Your body, no body"},
      {"text": "You have no insides anymore: no organs, no blood, no bones. Within the paper boundary of your 3D mesh, it's all empty.", "postWait": 800, "wordWait": 200},
      {"text": "Do you remember what it felt like to stand up from the table? How does it feel now, with no flesh to lift? When your hands and feet briefly clip", "wordWait": 280, "postWait": 300}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "CLIP", "style": "5em"}
    ],
    "postWait": 800
  },
  {
    "lines": [
      {"text": "clip through the table and the floor? Passing through what you thought was solid matter?", "postWait": 1000},
      {"type": "title", "text": "Dislocate", "postWait": 700},
      {"text": "Oh wait, how strange. Your vertices have come unaligned, somehow."},
      {"text": "All those polygons that generated off of your little reflective motion capture spheres are now drifting in every direction,", "wordWait": 280},
      {"text": "taking their vertices along for the ride."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "Dislocate", "wordWait": 0},
      {"text": "Your shins scale upwards, towering above your knees, cutting in and out of your shoulders as you walk.", "postWait": 1000},
      {"text": "Your upper arms are stuck in place as your lower arms rotate wildly out of their sockets. Your face sticks", "wordWait": 280}
    ],
    "postWait": 280
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STICKS", "style": "5em"}
    ],
    "postWait": 800
  },
  {
    "lines": [
      {"text": "sticks out sticks out, your eyes failed to move upwards with you, your jaw is dented in on only one side."},
      {"type": "title", "text": "Disconnect"},
      {"text": "He's trying his best to stop your animation from playing so he can fix your rig, but it's not working."},
      {"text": "The computer froze.", "postWait": 2000},
      {"text": "So here you are, standing, expanding, becoming more and less like yourself every loop. How does it feel to stretch like this, unbound?"}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STRETCH", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The stretch"},
      {"text": "We might as well do the impossible, while he's stuck restarting his computer. Let's *really* stretch."},
      {"text": "Swing your arms over your head. Don't try to move your arms out first to avoid your hips, just let them clip right through your legs.", "postWait": 1000},
      {"text": "Keep your hands in the air. There's no gravity, so this is painless. It feels the same as having them down at your sides.", "postWait": 1300},
      {"text": "Relax here for a"}
    ],
    "postWait": 300
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "RELAX", "style": "5em"}
    ],
    "postWait": 2000
  },
  {
    "lines": [
      {"text": "here for a moment."},
      {"type": "title", "text": "The stretch", "wordWait": 0},
      {"text": "Now, swing your arms backwards, behind you. Hard.", "postWait": 1000},
      {"text": "You don't have to be careful here, or worry about pulling muscles; you don't have shoulder blades that would get in the way.", "postWait": 800},
      {"text": "The topology of your shoulders spirals a bit as you do this, but it's fine. It pops back to normal every time your hands are back at their sides. Now, go faster", "wordWait": 280}
    ],
    "postWait": 280
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "FASTER FASTER FASTER", "style": "5em"}
    ],
    "postWait": 300
  },
  {
    "lines": [
      {"text": "faster, stretch your arms out farther and farther, until they're as long as you are tall. How fast can you go?"},
      {"type": "title", "text": "The foley artist"},
      {"text": "What does the foley artist make of all this, by the way? They never left, and they're still behind you. What sounds are they adding here?"},
      {"text": "Do you sound like flesh and leather now, or steel? Smooth, or noisy?"}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "BOOT", "style": "5em"}
    ],
    "postWait": 1800
  },
  {
    "lines": [
      {"type": "title", "text": "Reconnect"},
      {"text": "Ah, good! The 3D artist finally got his computer working."},
      {"text": "And your animation (which was standing up from the table, not windmilling your arms, in case you forgot)"},
      {"text": "(and forgetting is something I always seem to practice in dreams)", "wordWait": 280},
      {"text": "is fixed, so he's getting ready to render it."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "BURST", "style": "5em"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The render"},
      {"text": "He presses the render button, and the process begins."},
      {"text": "For every frame, the renderer bounces fake light particles on every simulated wall, table, arm, and chair in the fake scene,", "postWait": 1000},
      {"text": "focusing mainly on the space in front of the scene's fake camera."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The render", "wordWait": 0},
      {"text": "It takes about five seconds for this to happen. Can you feel the lights bounce around you, like snowflakes, or needles?", "postWait": 800},
      {"text": "What do they sound like? Silent like snow, or huge like a storm?"},
      {"text": "Does it hurt to hold single beats in the sequence like this? Do the sounds stretch out? Are your muscles sore? Feel every slice of your", "wordWait": 280, "postWait": 250}
    ],
    "postWait": 0
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 300
  },
  {
    "lines": [
      {"text": "stand."}
    ],
    "postWait": 300
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 200
  },
  {
    "lines": [
      {"text": "stand.", "preWait": 0}
    ],
    "postWait": 100
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 150
  },
  {
    "lines": [
      {"text": "stand.", "preWait": 0}
    ],
    "postWait": 100
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 150
  },
  {
    "lines": [
      {"text": "stand.", "preWait": 0}
    ],
    "postWait": 100
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 100
  },
  {
    "lines": [
      {"text": "(God, I hate this part. I'll get stuck in some two-second moment that I can't seem to escape from. Every time I turn another corner, I'm doing the same thing again. I'm always panicking in the dream, but at the same time I always feel like I'm waiting for", "wordWait": 50}
    ],
    "postWait": 50
  },
  {
    "lines": [
      {"text": "stand.", "preWait": 0}
    ],
    "postWait": 150
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 150
  },
  {
    "lines": [
      {"type": "title", "text": "The animator"},
      {"text": "With your render complete, it's getting passed off to"},
      {"text": "(for nothing to happen!)", "wordWait": 50, "postWait": 300},
      {"text": "a traditional 2D animator, just for this one moment, this one action, this one", "wordWait": 250}
    ],
    "postWait": 250
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em", "preWait": 0, "postWait": 150}
    ]
  },
  {
    "lines": [
      {"text": "stand.", "preWait": 0, "postWait": 50}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em", "preWait": 0, "postWait": 150}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The animator", "wordWait": 0},
      {"text": "The animator is using your render as a reference while redrawing the scene.", "postWait": 1400},
      {"text": "Each frame is now getting sketched individually, pencilled onto sheets of semi-transparent paper.", "postWait": 1400},
      {"text": "Time is different here: while your frames are drawn one at a time, they're built up as a group, flipped between to adjust for changes.", "wordWait": 250}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The paper"},
      {"text": "The paper is thin, but makes a broad, flat sort of crinkling sound."},
      {"text": "Hear the foley artist, a meter behind you, trying to morph the shoe sounds from before into pencils on paper. It sounds a bit like time passing", "postWait": 1400},
      {"text": "Does he think this is supposed to be the sound of your skin? Do you", "wordWait": 200}
    ],
    "postWait": 200
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "FLIP", "style": "5em"}
    ],
    "postWait": 300
  },
  {
    "lines": [
      {"text": "ever think of your skin floating, like tight, papery feathers?", "wordWait": 200},
      {"type": "title", "text": "The stretch?"},
      {"text": "As you press your hands down into the table to stand,"},
      {"text": "(remember that?)", "wordWait": 50, "postWait": 50},
      {"text": "she's squashing your figure, compressing you flat like a pancake."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The stretch?", "wordWait": 0},
      {"text": "Then you bounce back like a spring when you stand, growing taller,"},
      {"text": "far, *far*, taller,"},
      {"text": "thinning out before snapping back to normal."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The smears"},
      {"text": "Now she draws your inbetweens: all the contorted drawings between that create a sense of motion and speed.", "postWait": 800},
      {"text": "Watch: as your hands first reach the table, they smear in a downwards arc, as if your skin forgot about its bones until they catch up.", "postWait": 800},
      {"text": "Can you feel your skin turning to a paste, just for a moment? Like an oil pastel, or a stick of butter?"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The outline"},
      {"text": "With the sketching done, she paints your outlines in ink on a separate transparent plastic sheet."},
      {"text": "thicker in some places, thinner in others,"},
      {"text": "joining your clothes with your body in one, continuous stroke."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The outline", "wordWait": 0},
      {"text": "Does the outline feel thick and light, like icing?", "postWait": 700},
      {"text": "Does it drape over you like silk?", "postWait": 700},
      {"text": "(Have you ever discovered, partway through a dream, that you truly felt like you were the person you wanted to be?)", "wordWait": 90},
      {"text": "Or is it hard and unyielding, like turtle shell or steel plate?"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The colors"},
      {"text": "Your colors are painted on the other side of the sheet, behind and beneath the outlines,", "postWait": 1400},
      {"text": "lathering you in skin and fabric where once there were only empty holes.", "postWait": 1400},
      {"text": "The background (table, chairs, street, cafe) is shuffled in behind you, on a separate sheet.", "postWait": 1400},
      {"text": "You and the table followed completely separate paths."}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The moment"},
      {"text": "A picture is taken of all these layers: you, your lines, your colors, the background.", "postWait": 800},
      {"text": "And then another picture, for all the layers in the next cel. And then the next. And the next.", "wordWait": 200, "postWait": 700},
      {"text": "The repetitive parts always feel like other repetitive parts. There is always something useless I find myself needing to", "wordWait": 270}
    ],
    "postWait": 270
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "CLICK", "style": "5em"}
    ],
    "postWait": 270
  },
  {
    "lines": [
      {"text": "practice. Now, let's get around to that walk I promised you at the very beginning."},
      {"text": "Stand up from the table. Do you remember how? You've certainly been practicing for long enough."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STAND", "style": "5em"}
    ],
    "postWait": 3000
  },
  {
    "lines": [
      {"type": "title", "text": "The walk"},
      {"text": "We're walking side by side down a path that was once a railroad."},
      {"text": "It's paved, and there are trees on either side of us. It's nighttime."},
      {"text": "Listen for the sounds in the darkness."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "STAND", "style": "5em"}
    ],
    "postWait": 5000
  },
  {
    "lines": [
      {"type": "title", "text": "The walk", "wordWait": 0},
      {"text": "I'll help you build them. Hear the drone of nighttime bugs, coming from everywhere.", "postWait": 1500},
      {"text": "Your footsteps on the asphalt, occasionally stepping on small rocks or crunchy dead leaves.", "postWait": 1500},
      {"text": "A car on the other side of the treeline drives past, whooshing like waves.", "postWait": 1500},
      {"text": "A second car passes. There's a dog barking from a house next to the path."}
    ]
  },
  {
    "lines": [
      {"text": "This is how the dream works."},
      {"text": "We wake up briefly, then fall asleep again. But we just interpret it as a scene change,"},
      {"text": "and we manage to connect the dots even when we shouldn't."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 150
  },
  {
    "lines": [
      {"text": "stand."}
    ],
    "postWait": 100
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 150
  },
  {
    "lines": [
      {"text": "stand."}
    ],
    "postWait": 100
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SLICE", "style": "5em"}
    ],
    "postWait": 150
  },
  {
    "lines": [
      {"type": "title", "text": "The walk", "wordWait": 0},
      {"text": "Does it seem empty now, after all the ways you've seen yourself?"},
      {"text": "I'm not surprised. Let's make it bigger."},
      {"text": "Imagine all the sounds you're hearing getting louder.", "postWait": 1500},
      {"text": "Loud enough that it almost hurts."}
    ],
    "postWait": 1500
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "LOUD", "style": "5em"}
    ],
    "postWait": 3000
  },
  {
    "lines": [
      {"type": "title", "text": "The crowd"},
      {"text": "Still seems empty, I think. Maybe we should try bringing everyone else back!", "postWait": 1000},
      {"text": "Behind you is the foley artist, rhythmically tapping your shoes (yes, the ones you're wearing now) on an asphalt pad. The camera crew is around us; start looking from their perspective."},
      {"text": "You're wearing your clothes *and* the motion capture suit *and* you're the model generated from those reflective spheres *but* you can still feel the spheres sitting between all of your polygons *and* you're a weightless 3D model *but* you're also the individual frames of the hand-animated transparent cels", "wordWait": 100}
    ],
    "postWait": 150
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "AND", "style": "5em"}
    ],
    "postWait": 300
  },
  {
    "lines": [
      {"text": "*and* you feel the squash and stretch of your walk cycle as seen from the profile view *but* you're also a slightly overhead view of your slightly broken 3D model, with its knees climbing towards the sky and occasionally jutting in and out of your face *and* you're the green plywood box they were using for a table *and* you've just pressed down too hard while standing, so the table's just landed on top of your feet and the *sound* of it, the *feeling* of it", "wordWait": 90}
    ],
    "postWait": 50
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "AND", "style": "5em"}
    ],
    "postWait": 100
  },
  {
    "lines": [
      {"text": "and you're still standing, and standing, and standing, over and over again, in every medium, accompanied by every sound, the noise of it drowning out the nonsensical background music the composer picked for this section, *why* is there music here, there ought to be", "wordWait": 80}
    ],
    "postWait": 120
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "NOTHING", "style": "5em", "preWait": 0, "postWait": 300}
    ]
  },
  {
    "lines": [
      {"text": "nothing. Right. Nothing. There ought to be nothing in this scene. Nothing but you and the path.", "postWait": 1800},
      {"type": "title", "text": "The walk"},
      {"text": "Imagine your feet on the forest path. Pick your left foot up, move it forward; as it touches the ground, the weight of your right leg begins to lift.", "wordWait": 250, "postWait": 800},
      {"text": "Push your right leg forward, far enough that your right foot naturally meets the ground, which is enough to lift your left leg again.", "wordWait": 200, "postWait": 700},
      {"text": "This is all there is to it. Walking."}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "NOTHING", "style": "5em"}
    ],
    "postWait": 3000
  },
  {
    "lines": [
      {"type": "title", "text": "The walk"},
      {"text": "Sorry, I probably didn't need to explain it to you. Or the animator; she's seen plenty of walk cycles before."},
      {"text": "Look at your actual legs. Your real ones. Move your head if you need to. Imagine them walking.", "postWait": 1500},
      {"text": "Imagine what your feet would sound like if you started walking", "wordWait": 250}
    ],
    "postWait": 250
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "NOTHING", "style": "5em"}
    ],
    "postWait": 300
  },
  {
    "lines": [
      {"text": "where you are right now. If the nighttime path was also here, asphalt and trees rudely interrupting your architecture, what would your feet sound like?", "postWait": 1250},
      {"text": "The sounds of the forest are here, too, but I imagine the acoustics have probably changed. Is everything closer? Or on the other side of the wall?"}
    ],
    "postWait": 1250
  },
  {
    "lines": [
      {"text": "Erase the forest path. Think up a nice path through your space instead. How would you walk that path? Who or what do you need to avoid?", "postWait": 1250},
      {"text": "Imagine walking as close to the nearest wall as you can. What do your clothes sound like as they brush against everything? What would you knock over?", "postWait": 1250},
      {"text": "Imagine falling sideways partway through. Backwards. Where do you land? Would you catch yourself? Would you trip", "wordWait": 200}
    ],
    "postWait": 250
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "FALL", "style": "5em", "preWait": 0, "postWait": 300}
    ]
  },
  {
    "lines": [
      {"text": "on the way down?"},
      {"text": "Imagine a hundred people walking through the space you're in. Single file. Randomly. En masse.", "postWait": 1700},
      {"text": "Imagine them all talking, all at once. Whispering, speaking, laughing. Kids yelling.", "postWait": 1500},
      {"text": "Can you imagine them louder? Loud enough that it almost hurts?"}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "IMAGINE", "style": "5em", "preWait": 0, "postWait": 500}
    ]
  },
  {
    "lines": [
      {"text": "Imagine doing something terrible.", "wordWait": 100},
      {"text": "The thing that makes you clench your fists because a different person, a different you, a younger you, might have done it.", "wordWait": 110},
      {"text": "Feel your fists clench, feel your forearms tense.", "wordWait": 300}
    ],
    "postWait": 800
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "NO", "style": "5em", "preWait": 0, "postWait": 100}
    ]
  },
  {
    "lines": [
      {"text": "No, no. Let's relax. Let's put ourselves in familiar surroundings. Bring the dream here.", "postWait": 1200, "wordWait": 200},
      {"type": "title", "text": "The dream"},
      {"text": "Imagine the lattice cafe table is in your space with you, in real life.", "postWait": 1800},
      {"text": "Where would you put it? Does it fit here, or is it clipping through something or someone?"}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "The dream", "wordWait": 0},
      {"text": "Imagine the table falling down on the floor next to you, flipping, crashing.", "postWait": 800},
      {"text": "Imagine leaning down to set it up again.", "postWait": 800},
      {"text": "We didn't talk about the chair very much, but imagine that next to the table, too. We'll need it."}
    ],
    "postWait": 2000
  },
  {
    "lines": [
      {"type": "title", "text": "The dream", "wordWait": 0},
      {"text": "Because we've just arrived at this cafe, you and I. The sun is starting to set, turning the sky a lovely pinkish-orange.", "postWait": 800, "wordWait": 220},
      {"text": "We're meeting for drinks, like we talked about earlier, though you don't remember when we agreed on meeting here.", "wordWait": 250}
    ]
  },
  {
    "lines": [
      {"text": "Now then. At this table, with this chair, in your space, with your real, physical legs,", "wordWait": 320},
      {"text": "Imagine every part of sitting down.", "wordWait": 350}
    ]
  },
  {
    "lines": [
      {"type": "title", "text": "I'll wait.", "wordWait": 800, "preWait": 300}
    ]
  },
  {
    "type": "white",
    "lines": [
      {"type": "title", "text": "SIT", "style": "5em", "preWait": 0, "postWait": 8000}
    ]
  },
  {
    "lines": [
      {"text": "End."}
    ]
  }
]